<?php
// $answer = [$_POST['q1'], $_POST['q2'], $_POST['q3'], $_POST['q4'], $_POST['q5'], $_POST['q6'], $_POST['q7'], $_POST['q8'], $_POST['q9'], $_POST['q10']];
// $true_answer = ["35", "56", "70", "45", "125", "16", "81", "42", "27", "91"];

// $b = 0;
// $c = 0;

// for ($i = 0; $i < count($answer); $i++) {
//     if ($answer[$i] == $true_answer[$i]) {
//         $b = $b + 1;
//     } else {
//         $c = $c + 1;
//     }
// }
// if ($b >= 5) {
//     echo 'количество правильных ответов  ' . $b . "<br>";
//     echo "вы знаете таблицу умножения)";
// } else {
//     echo 'количество  не правильных ответов  ' . $c . "<br>";
//     echo "вы не знаете таблицу умножения(";
// }
$right =  ($_POST['q1'] == 35)
    + ($_POST['q2'] == 56)
    + ($_POST['q3'] == 70)
    + ($_POST['q4'] == 45)
    + ($_POST['q5'] == 125)
    + ($_POST['q6'] == 16)
    + ($_POST['q7'] == 81)
    + ($_POST['q8'] == 42)
    + ($_POST['q9'] == 27)
    + ($_POST['q10'] == 91);

echo $right >= 5 ? "Зачет" : "Не зачет";
   

// // if ($_POST['q1'] == 35) {
// //     $right++;
// // }
// if ($_POST['q2'] == 56) {
//     $right++;
// }
// if ($_POST['q3'] == 70) {
//     $right++;
// }
// if ($_POST['q4'] == 45) {
//     $right++;
// }
// if ($_POST['q5'] == 125) {
//     $right++;
// }
// if ($_POST['q6'] == 16) {
//     $right++;
// }
// if ($_POST['q7'] == 81) {
//     $right++;
// }
// if ($_POST['q8'] == 42) {
//     $right++;
// }
// if ($_POST['q9'] == 27) {
//     $right++;
// }
// if ($_POST['q10'] == 91) {
//     $right++;
// }
